# StructuralMaterialTypeFilter Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
StructuralMaterialTypeFilter Properties
StructuralMaterialTypeFilter Class See Also
---
The StructuralMaterialTypeFilter type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Inverted | True if the results of the filter are inverted; elements that would normally be accepted by this filter will be rejected, and elements that would normally be rejected will be accepted.  (Inherited from ElementFilter.) |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from ElementFilter.) |
| StructuralMaterialType | The structural material type. |

# See Also
StructuralMaterialTypeFilter Class
Autodesk.Revit.DB.Structure Namespace